EMACS/latex-template.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>A LaTeX Template</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="A LaTeX Template"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-08-13 10:03:16 PDT"/>
<meta name="author" content="Leslie"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="http://lesliezhu.github.com/stylesheets/main.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="http://lesliezhu.github.com"> UP </a>
 |
 <a accesskey="H" href="http://lesliezhu.github.com"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">A LaTeX Template</h1>











<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Source Code</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Source Code</h2>
<div class="outline-text-2" id="text-1">





<pre class="src src-latex"><span style="color: #00ffff; font-weight: bold;">\documentclass</span>[11pt]{<span style="color: #0000ff; font-weight: bold;">article</span>}
<span style="color: #00ffff; font-weight: bold;">\usepackage</span>[utf8]{<span style="color: #0000ff; font-weight: bold;">inputenc</span>}
<span style="color: #00ffff; font-weight: bold;">\usepackage</span>[T1]{<span style="color: #0000ff; font-weight: bold;">fontenc</span>}
<span style="color: #00ffff; font-weight: bold;">\usepackage</span>{<span style="color: #0000ff; font-weight: bold;">fixltx2e</span>}
<span style="color: #00ffff; font-weight: bold;">\usepackage</span>{<span style="color: #0000ff; font-weight: bold;">graphicx</span>}
<span style="color: #00ffff; font-weight: bold;">\usepackage</span>{<span style="color: #0000ff; font-weight: bold;">longtable</span>}
<span style="color: #00ffff; font-weight: bold;">\usepackage</span>{<span style="color: #0000ff; font-weight: bold;">float</span>}
<span style="color: #00ffff; font-weight: bold;">\usepackage</span>{<span style="color: #0000ff; font-weight: bold;">wrapfig</span>}
<span style="color: #00ffff; font-weight: bold;">\usepackage</span>{<span style="color: #0000ff; font-weight: bold;">soul</span>}
<span style="color: #00ffff; font-weight: bold;">\usepackage</span>{<span style="color: #0000ff; font-weight: bold;">textcomp</span>}
<span style="color: #00ffff; font-weight: bold;">\usepackage</span>{<span style="color: #0000ff; font-weight: bold;">marvosym</span>}
<span style="color: #00ffff; font-weight: bold;">\usepackage</span>{<span style="color: #0000ff; font-weight: bold;">wasysym</span>}
<span style="color: #00ffff; font-weight: bold;">\usepackage</span>{<span style="color: #0000ff; font-weight: bold;">latexsym</span>}
<span style="color: #00ffff; font-weight: bold;">\usepackage</span>{<span style="color: #0000ff; font-weight: bold;">amssymb</span>}
<span style="color: #00ffff; font-weight: bold;">\usepackage</span>{<span style="color: #0000ff; font-weight: bold;">hyperref</span>}
<span style="color: #00ffff; font-weight: bold;">\tolerance</span>=1000

<span style="color: #ff0000;">%</span><span style="color: #ff0000;">begin</span>


<span style="color: #00ffff; font-weight: bold;">\usepackage</span>{<span style="color: #0000ff; font-weight: bold;">xltxtra</span>}
<span style="color: #00ffff; font-weight: bold;">\setmainfont</span>[Mapping=tex-text]{WenQuanYi Zen Hei} <span style="color: #ff0000;">%font</span>
<span style="color: #00ffff; font-weight: bold;">\XeTeXlinebreaklocale</span> <span style="color: #00ff00;">``zh''</span>  
<span style="color: #00ffff; font-weight: bold;">\XeTeXlinebreakskip</span> = 0pt plus 1pt minus 0.1pt
<span style="color: #00ffff; font-weight: bold;">\usepackage</span>{<span style="color: #0000ff; font-weight: bold;">geometry</span>}<span style="color: #00ffff; font-weight: bold;">\geometry</span>{left=1.00cm,right=2.5cm,top=2.5cm,bottom=2.5cm} <span style="color: #ff0000;">%width,height</span>
<span style="color: #00ffff; font-weight: bold;">\usepackage</span>{<span style="color: #0000ff; font-weight: bold;">indentfirst</span>}             
<span style="color: #00ffff; font-weight: bold;">\usepackage</span>[perpage,symbol]{<span style="color: #0000ff; font-weight: bold;">footmisc</span>}
<span style="color: #00ffff; font-weight: bold;">\usepackage</span>{<span style="color: #0000ff; font-weight: bold;">titletoc</span>}                
<span style="color: #00ffff; font-weight: bold;">\titlecontents</span>{section}[0pt]{<span style="color: #00ffff; font-weight: bold;">\addvspace</span>{2pt}<span style="color: #00ffff; font-weight: bold;">\filright</span>}
              {<span style="color: #00ffff; font-weight: bold;">\contentspush</span>{<span style="color: #00ffff; font-weight: bold;">\thecontentslabel</span>\ }}
              {}{<span style="color: #00ffff; font-weight: bold;">\titlerule*</span>[8pt]{.}<span style="color: #00ffff; font-weight: bold;">\contentspage</span>}
<span style="color: #00ffff; font-weight: bold;">\usepackage</span>{<span style="color: #0000ff; font-weight: bold;">listings</span>}
<span style="color: #00ffff; font-weight: bold;">\usepackage</span>{<span style="color: #0000ff; font-weight: bold;">xcolor</span>}
<span style="color: #00ffff; font-weight: bold;">\lstset</span>{numbers=left,
  numberstyle=<span style="color: #00ffff; font-weight: bold;">\tiny</span>,
  keywordstyle=<span style="color: #00ffff; font-weight: bold;">\color</span>{blue!70},
  commentstyle=<span style="color: #00ffff; font-weight: bold;">\color</span>{red!50!green!50!blue!50},
  frame=shadowbox,
  rulesepcolor=<span style="color: #00ffff; font-weight: bold;">\color</span>{red!20!green!20!blue!20}
}
<span style="color: #00ffff; font-weight: bold;">\lstset</span>{language=C++}
<span style="color: #00ffff; font-weight: bold;">\lstset</span>{breaklines}
<span style="color: #00ffff; font-weight: bold;">\lstset</span>{extendedchars=false}  <span style="color: #ff0000;">%source code box</span>


<span style="color: #ff0000;">%</span><span style="color: #ff0000;">end</span>

<span style="color: #00ffff; font-weight: bold;">\providecommand</span>{<span style="color: #0000ff; font-weight: bold;">\alert</span>}[1]{<span style="color: #00ffff; font-weight: bold;">\textbf</span>{<span style="font-weight: bold;">#1</span>}}

<span style="color: #00ffff; font-weight: bold;">\title</span>{<span style="color: #0000ff; font-weight: bold;">LaTeX Template</span>}
<span style="color: #00ffff; font-weight: bold;">\author</span>{Leslie Zhu}
<span style="color: #00ffff; font-weight: bold;">\date</span>{<span style="color: #00ffff; font-weight: bold;">\today</span>}
<span style="color: #00ffff; font-weight: bold;">\hypersetup</span>{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.8.11}}

<span style="color: #00ffff; font-weight: bold;">\begin</span>{<span style="color: #0000ff; font-weight: bold;">document</span>}

<span style="color: #00ffff; font-weight: bold;">\maketitle</span>

<span style="color: #00ffff; font-weight: bold;">\setcounter</span>{<span style="color: #ffff00;">tocdepth</span>}{8}
<span style="color: #00ffff; font-weight: bold;">\tableofcontents</span>
<span style="color: #00ffff; font-weight: bold;">\vspace*</span>{1cm}

<span style="color: #00ffff; font-weight: bold;">\section</span>{<span style="color: #0000ff; font-weight: bold;">example one</span>}
<span style="color: #00ffff; font-weight: bold;">\label</span>{<span style="color: #ff00ff;">sec-1</span>}



<span style="color: #00ffff; font-weight: bold;">\begin</span>{<span style="color: #0000ff; font-weight: bold;">verbatim</span>}
example two
<span style="color: #00ffff; font-weight: bold;">\end</span>{<span style="color: #0000ff; font-weight: bold;">verbatim</span>}

<span style="color: #00ffff; font-weight: bold;">\section</span>{<span style="color: #0000ff; font-weight: bold;">example three</span>}
<span style="color: #00ffff; font-weight: bold;">\label</span>{<span style="color: #ff00ff;">sec-2</span>}


base on the discuss....

<span style="color: #00ffff; font-weight: bold;">\end</span>{<span style="color: #0000ff; font-weight: bold;">document</span>}
</pre>




<div class="ds-thread"></div>
<script type="text/javascript">
var duoshuoQuery = {short_name:"lesliezhu"};
(function() {
var ds = document.createElement('script');
ds.type = 'text/javascript';ds.async = true;
ds.src = 'http://static.duoshuo.com/embed.js';
ds.charset = 'UTF-8';
(document.getElementsByTagName('head')[0] 
|| document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script>
</div>
</div>
</div>

<div id="postamble">
<p class="date">日期: 2013-08-13 10:03:16 PDT</p>
<p class="author">作者: Leslie</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
